In [ ]:
import pandas as pd
pd.__version__

In [ ]:
titanic_df = pd.read_csv('../data/train.csv')
print(type(titanic_df))

In [ ]:
titanic_df

In [ ]:
print(titanic_df.shape)

In [ ]:
titanic_df.head()

In [ ]:
titanic_df.tail()

In [ ]:
display(titanic_df.head(3))
titanic_df.tail(3)

In [ ]:
pd.set_option("display.max_rows", 1000)
pd.set_option("display.max_colwidth", 100)
pd.set_option('display.max_columns', 100)

In [ ]:
titanic_df

In [ ]:
titanic_df.shape

In [ ]:
dict1 = {'Name' : ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
         'Year' : [2011, 2016, 2015, 2015],
         'Gender': ['Male', 'Female', 'Male', 'Male']}
data_df = pd.DataFrame(dict1)
print(data_df)
print("#"*30)

data_df = pd.DataFrame(dict1, columns=["Name", "Year", "Gender", "Age"])
print(data_df)
print("#"*30)

data_df = pd.DataFrame(dict1, index=['one', 'two', 'three', 'four'])
print(data_df)
print('#'*30)

In [ ]:
print(titanic_df.columns)
print(titanic_df.index)
print(titanic_df.index.values)

In [ ]:
titanic_df.info()

In [ ]:
titanic_df.info()

In [ ]:
titanic_df.describe()

In [ ]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

In [ ]:
titanic_df['Pclass'].head()

In [ ]:
titanic_df_pclass = titanic_df['Pclass']
print(type(titanic_df_pclass))

In [ ]:
print(titanic_df.shape[0])
print(titanic_df['Embarked'].value_counts())
print(titanic_df['Embarked'].value_counts(dropna=False))

In [ ]:
titanic_df[['Pclass', 'Embarked']].value_counts()

In [ ]:
import numpy as np
col_name1 = ['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)

print(array1.shape)
df_list1 = pd.DataFrame(list1, columns=col_name1)
print(df_list1)
df_array1 = pd.DataFrame(array1, columns=col_name1)
print(df_array1)

In [ ]:
col_name2 = ['col1', 'col2', 'col3']
list2 = [[1, 2, 3],
         [11, 12, 13]]
array2 = np.array(list2)
print(array2.shape)
df_list2 = pd.DataFrame(list2, columns=col_name2)
print(df_list2)

In [ ]:
dict = {'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}
df_dict = pd.DataFrame(dict)
print(df_dict)

In [ ]:
array3 = df_dict.values
print(array3.shape)
print(array3)

In [ ]:
list3 = df_dict.values.tolist()
print(type(list3))
print(list3)

In [ ]:
dict3 = df_dict.to_dict('list')
print(type(dict3))
print(dict3)

In [ ]:
titanic_df['Age_0'] = 0
titanic_df.head(3)

In [ ]:
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch']+1
titanic_df.head(3)

In [ ]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

In [ ]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1, inplace=False)
titanic_drop_df

In [33]:
array1 = np.array([1,2,3,4])
array1

array([1, 2, 3, 4])

In [34]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

In [35]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [36]:
titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [39]:
pd.set_option("display.width", 1000)
pd.set_option('display.max_colwidth', 15)
print(titanic_df.head(6))

titanic_df.drop([0, 1, 2], axis=0, inplace=True)
print(titanic_df.head(3))

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
3            4         1       1  Futrelle, M...  female  35.0      1      0          113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0          330877   8.4583   NaN        Q
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q